TexasInstruments/f29h85x-mcal/drivers/hw_include/f29h85x/hw_mcan.h
//###########################################################################
//
// FILE:    hw_mcan.h
//
// TITLE:   Definitions for the MCAN registers.
//
//###########################################################################
// $Copyright:  $
//###########################################################################

#ifndef HW_MCAN_H
#define HW_MCAN_H

//*************************************************************************************************
//
// The following are defines for the MCAN register offsets
//
//*************************************************************************************************
#define MCAN_O_SS_PID                           0x0U    // MCAN Subsystem Revision Register
#define MCAN_O_SS_CTRL                          0x4U    // MCAN Subsystem Control Register
#define MCAN_O_SS_STAT                          0x8U    // MCAN Subsystem Status Register
#define MCAN_O_SS_ICS                           0xCU    // MCAN Subsystem Interrupt Clear Shadow
                                                        // Register
#define MCAN_O_SS_IRS                           0x10U   // MCAN Subsystem Interrupt Raw Satus
                                                        // Register
#define MCAN_O_SS_IECS                          0x14U   // MCAN Subsystem Interrupt Enable Clear
                                                        // Shadow Register
#define MCAN_O_SS_IE                            0x18U   // MCAN Subsystem Interrupt Enable Register
#define MCAN_O_SS_IES                           0x1CU   // MCAN Subsystem Interrupt Enable Status
#define MCAN_O_SS_EOI                           0x20U   // MCAN Subsystem End of Interrupt
#define MCAN_O_SS_EXT_TS_PRESCALER              0x24U   // MCAN Subsystem External Timestamp
                                                        // Prescaler 0
#define MCAN_O_SS_EXT_TS_UNSERVICED_INTR_CNTR   0x28U   // MCAN Subsystem External Timestamp
                                                        // Unserviced Interrupts Counter

#define MCAN_O_CREL     0x0U    // MCAN Core Release Register
#define MCAN_O_ENDN     0x4U    // MCAN Endian Register
#define MCAN_O_DBTP     0xCU    // MCAN Data Bit Timing and Prescaler Register
#define MCAN_O_TEST     0x10U   // MCAN Test Register
#define MCAN_O_RWD      0x14U   // MCAN RAM Watchdog
#define MCAN_O_CCCR     0x18U   // MCAN CC Control Register
#define MCAN_O_NBTP     0x1CU   // MCAN Nominal Bit Timing and Prescaler Register
#define MCAN_O_TSCC     0x20U   // MCAN Timestamp Counter Configuration
#define MCAN_O_TSCV     0x24U   // MCAN Timestamp Counter Value
#define MCAN_O_TOCC     0x28U   // MCAN Timeout Counter Configuration
#define MCAN_O_TOCV     0x2CU   // MCAN Timeout Counter Value
#define MCAN_O_ECR      0x40U   // MCAN Error Counter Register
#define MCAN_O_PSR      0x44U   // MCAN Protocol Status Register
#define MCAN_O_TDCR     0x48U   // MCAN Transmitter Delay Compensation Register
#define MCAN_O_IR       0x50U   // MCAN Interrupt Register
#define MCAN_O_IE       0x54U   // MCAN Interrupt Enable
#define MCAN_O_ILS      0x58U   // MCAN Interrupt Line Select
#define MCAN_O_ILE      0x5CU   // MCAN Interrupt Line Enable
#define MCAN_O_GFC      0x80U   // MCAN Global Filter Configuration
#define MCAN_O_SIDFC    0x84U   // MCAN Standard ID Filter Configuration
#define MCAN_O_XIDFC    0x88U   // MCAN Extended ID Filter Configuration
#define MCAN_O_XIDAM    0x90U   // MCAN Extended ID and Mask
#define MCAN_O_HPMS     0x94U   // MCAN High Priority Message Status
#define MCAN_O_NDAT1    0x98U   // MCAN New Data 1
#define MCAN_O_NDAT2    0x9CU   // MCAN New Data 2
#define MCAN_O_RXF0C    0xA0U   // MCAN Rx FIFO 0 Configuration
#define MCAN_O_RXF0S    0xA4U   // MCAN Rx FIFO 0 Status
#define MCAN_O_RXF0A    0xA8U   // MCAN Rx FIFO 0 Acknowledge
#define MCAN_O_RXBC     0xACU   // MCAN Rx Buffer Configuration
#define MCAN_O_RXF1C    0xB0U   // MCAN Rx FIFO 1 Configuration
#define MCAN_O_RXF1S    0xB4U   // MCAN Rx FIFO 1 Status
#define MCAN_O_RXF1A    0xB8U   // MCAN Rx FIFO 1 Acknowledge
#define MCAN_O_RXESC    0xBCU   // MCAN Rx Buffer / FIFO Element Size Configuration
#define MCAN_O_TXBC     0xC0U   // MCAN Tx Buffer Configuration
#define MCAN_O_TXFQS    0xC4U   // MCAN Tx FIFO / Queue Status
#define MCAN_O_TXESC    0xC8U   // MCAN Tx Buffer Element Size Configuration
#define MCAN_O_TXBRP    0xCCU   // MCAN Tx Buffer Request Pending
#define MCAN_O_TXBAR    0xD0U   // MCAN Tx Buffer Add Request
#define MCAN_O_TXBCR    0xD4U   // MCAN Tx Buffer Cancellation Request
#define MCAN_O_TXBTO    0xD8U   // MCAN Tx Buffer Transmission Occurred
#define MCAN_O_TXBCF    0xDCU   // MCAN Tx Buffer Cancellation Finished
#define MCAN_O_TXBTIE   0xE0U   // MCAN Tx Buffer Transmission Interrupt Enable
#define MCAN_O_TXBCIE   0xE4U   // MCAN Tx Buffer Cancellation Finished Interrupt Enable
#define MCAN_O_TXEFC    0xF0U   // MCAN Tx Event FIFO Configuration
#define MCAN_O_TXEFS    0xF4U   // MCAN Tx Event FIFO Status
#define MCAN_O_TXEFA    0xF8U   // MCAN Tx Event FIFO Acknowledge

#define MCAN_O_ERR_REV               0x0U     // MCAN Error Aggregator Revision Register
#define MCAN_O_ERR_VECTOR            0x8U     // MCAN ECC Vector Register
#define MCAN_O_ERR_STAT              0xCU     // MCAN Error Misc Status
#define MCAN_O_ERR_WRAP_REV          0x10U    // MCAN ECC Wrapper Revision Register
#define MCAN_O_ERR_CTRL              0x14U    // MCAN ECC Control
#define MCAN_O_ERR_ERR_CTRL1         0x18U    // MCAN ECC Error Control 1 Register
#define MCAN_O_ERR_ERR_CTRL2         0x1CU    // MCAN ECC Error Control 2 Register
#define MCAN_O_ERR_ERR_STAT1         0x20U    // MCAN ECC Error Status 1 Register
#define MCAN_O_ERR_ERR_STAT2         0x24U    // MCAN ECC Error Status 2 Register
#define MCAN_O_ERR_ERR_STAT3         0x28U    // MCAN ECC Error Status 3 Register
#define MCAN_O_ERR_SEC_EOI           0x3CU    // MCAN Single Error Corrected End of Interrupt
                                              // Register
#define MCAN_O_ERR_SEC_STATUS        0x40U    // MCAN Single Error Corrected Interrupt Status
                                              // Register
#define MCAN_O_ERR_SEC_ENABLE_SET    0x80U    // MCAN Single Error Corrected Interrupt Enable Set
                                              // Register
#define MCAN_O_ERR_SEC_ENABLE_CLR    0xC0U    // MCAN Single Error Corrected Interrupt Enable Clear
                                              // Register
#define MCAN_O_ERR_DED_EOI           0x13CU   // MCAN Double Error Detected End of Interrupt
                                              // Register
#define MCAN_O_ERR_DED_STATUS        0x140U   // MCAN Double Error Detected Interrupt Status
                                              // Register
#define MCAN_O_ERR_DED_ENABLE_SET    0x180U   // MCAN Double Error Detected Interrupt Enable Set
                                              // Register
#define MCAN_O_ERR_DED_ENABLE_CLR    0x1C0U   // MCAN Double Error Detected Interrupt Enable Clear
                                              // Register
#define MCAN_O_ERR_AGGR_ENABLE_SET   0x200U   // MCAN Error Aggregator Enable Set Register
#define MCAN_O_ERR_AGGR_ENABLE_CLR   0x204U   // MCAN Error Aggregator Enable Clear Register
#define MCAN_O_ERR_AGGR_STATUS_SET   0x208U   // MCAN Error Aggregator Status Set Register
#define MCAN_O_ERR_AGGR_STATUS_CLR   0x20CU   // MCAN Error Aggregator Status Clear Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_PID register
//
//*************************************************************************************************
#define MCAN_SS_PID_MINOR_S       0U
#define MCAN_SS_PID_MINOR_M       0x3FU         // Minor Revision
#define MCAN_SS_PID_MAJOR_S       8U
#define MCAN_SS_PID_MAJOR_M       0x700U        // Major Revision
#define MCAN_SS_PID_MODULE_ID_S   16U
#define MCAN_SS_PID_MODULE_ID_M   0xFFF0000U    // Module Identification Number
#define MCAN_SS_PID_SCHEME_S      30U
#define MCAN_SS_PID_SCHEME_M      0xC0000000U   // PID Register Scheme

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_CTRL register
//
//*************************************************************************************************
#define MCAN_SS_CTRL_DBGSUSP_FREE     0x8U    // Debug Suspend Free
#define MCAN_SS_CTRL_WAKEUPREQEN      0x10U   // Wakeup Request Enable
#define MCAN_SS_CTRL_AUTOWAKEUP       0x20U   // Automatic Wakeup Enable
#define MCAN_SS_CTRL_EXT_TS_CNTR_EN   0x40U   // External Timestamp Counter Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_STAT register
//
//*************************************************************************************************
#define MCAN_SS_STAT_RESET           0x1U   // Soft Reset Status
#define MCAN_SS_STAT_MEM_INIT_DONE   0x2U   // Memory Initialization Done
#define MCAN_SS_STAT_ENABLE_FDOE     0x4U   // Flexible Datarate Operation Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_ICS register
//
//*************************************************************************************************
#define MCAN_SS_ICS_EXT_TS_CNTR_OVFL   0x1U   // External Timestamp Counter Overflow Interrupt
                                              // Status Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_IRS register
//
//*************************************************************************************************
#define MCAN_SS_IRS_EXT_TS_CNTR_OVFL   0x1U   // External Timestamp Counter Overflow Interrupt
                                              // Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_IECS register
//
//*************************************************************************************************
#define MCAN_SS_IECS_EXT_TS_CNTR_OVFL   0x1U   // External Timestamp Counter Overflow Interrupt
                                               // Enable Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_IE register
//
//*************************************************************************************************
#define MCAN_SS_IE_EXT_TS_CNTR_OVFL   0x1U   // External Timestamp Counter Overflow Interrupt
                                             // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_IES register
//
//*************************************************************************************************
#define MCAN_SS_IES_EXT_TS_CNTR_OVFL   0x1U   // External Timestamp Counter Overflow Interrupt
                                              // Enable Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_EOI register
//
//*************************************************************************************************
#define MCAN_SS_EOI_EOI_S   0U
#define MCAN_SS_EOI_EOI_M   0xFFU   // External Timestamp Counter Overflow End of Interrupt

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_EXT_TS_PRESCALER register
//
//*************************************************************************************************
#define MCAN_SS_EXT_TS_PRESCALER_PRESCALER_S   0U
#define MCAN_SS_EXT_TS_PRESCALER_PRESCALER_M   0xFFFFFFU   // External Timestamp Prescaler

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANSS_EXT_TS_UNSERVICED_INTR_CNTR register
//
//*************************************************************************************************
#define MCAN_SS_EXT_TS_UNSERVICED_INTR_CNTR_EXT_TS_INTR_CNTR_S   0U
#define MCAN_SS_EXT_TS_UNSERVICED_INTR_CNTR_EXT_TS_INTR_CNTR_M   0x1FU   // External Timestamp
                                                                         // Counter Unserviced Rollover
                                                                         // Interrupts


//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_CREL register
//
//*************************************************************************************************
#define MCAN_CREL_DAY_S       0U
#define MCAN_CREL_DAY_M       0xFFU         // Time Stamp Day
#define MCAN_CREL_MON_S       8U
#define MCAN_CREL_MON_M       0xFF00U       // Time Stamp Month
#define MCAN_CREL_YEAR_S      16U
#define MCAN_CREL_YEAR_M      0xF0000U      // Time Stamp Year
#define MCAN_CREL_SUBSTEP_S   20U
#define MCAN_CREL_SUBSTEP_M   0xF00000U     // Sub-Step of Core Release
#define MCAN_CREL_STEP_S      24U
#define MCAN_CREL_STEP_M      0xF000000U    // Step of Core Release
#define MCAN_CREL_REL_S       28U
#define MCAN_CREL_REL_M       0xF0000000U   // Core Release

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_DBTP register
//
//*************************************************************************************************
#define MCAN_DBTP_DSJW_S     0U
#define MCAN_DBTP_DSJW_M     0xFU        // Data Resynchronization Jump Width
#define MCAN_DBTP_DTSEG2_S   4U
#define MCAN_DBTP_DTSEG2_M   0xF0U       // Data Time Segment After Sample Point
#define MCAN_DBTP_DTSEG1_S   8U
#define MCAN_DBTP_DTSEG1_M   0x1F00U     // Data Time Segment Before Sample Point
#define MCAN_DBTP_DBRP_S     16U
#define MCAN_DBTP_DBRP_M     0x1F0000U   // Data Bit Rate Prescaler
#define MCAN_DBTP_TDC        0x800000U   // Transmitter Delay Compensation

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_TEST register
//
//*************************************************************************************************
#define MCAN_TEST_LBCK   0x10U   // Loop Back Mode
#define MCAN_TEST_TX_S   5U
#define MCAN_TEST_TX_M   0x60U   // Control of Transmit Pin
#define MCAN_TEST_RX     0x80U   // Receive Pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_RWD register
//
//*************************************************************************************************
#define MCAN_RWD_WDC_S   0U
#define MCAN_RWD_WDC_M   0xFFU     // Watchdog Configuration
#define MCAN_RWD_WDV_S   8U
#define MCAN_RWD_WDV_M   0xFF00U   // Watchdog Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_CCCR register
//
//*************************************************************************************************
#define MCAN_CCCR_INIT   0x1U      // Initialization
#define MCAN_CCCR_CCE    0x2U      // Configuration Change Enable
#define MCAN_CCCR_ASM    0x4U      // Restricted Operation Mode
#define MCAN_CCCR_CSA    0x8U      // Clock Stop Acknowledge
#define MCAN_CCCR_CSR    0x10U     // Clock Stop Request
#define MCAN_CCCR_MON    0x20U     // Bus Monitoring Mode
#define MCAN_CCCR_DAR    0x40U     // Disable Automatic Retransmission
#define MCAN_CCCR_TEST   0x80U     // Test Mode Enable
#define MCAN_CCCR_FDOE   0x100U    // Flexible Datarate Operation Enable
#define MCAN_CCCR_BRSE   0x200U    // Bit Rate Switch Enable
#define MCAN_CCCR_PXHD   0x1000U   // Protocol Exception Handling Disable
#define MCAN_CCCR_EFBI   0x2000U   // Edge Filtering During Bus Integration
#define MCAN_CCCR_TXP    0x4000U   // Transmit Pause
#define MCAN_CCCR_NISO   0x8000U   // Non-ISO Operation

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_NBTP register
//
//*************************************************************************************************
#define MCAN_NBTP_NTSEG2_S   0U
#define MCAN_NBTP_NTSEG2_M   0x7FU         // Nominal Time Segment After Sample Point
#define MCAN_NBTP_NTSEG1_S   8U
#define MCAN_NBTP_NTSEG1_M   0xFF00U       // Nominal Time Segment Before Sample Point
#define MCAN_NBTP_NBRP_S     16U
#define MCAN_NBTP_NBRP_M     0x1FF0000U    // Nominal Bit Rate Prescaler
#define MCAN_NBTP_NSJW_S     25U
#define MCAN_NBTP_NSJW_M     0xFE000000U   // Nominal (Re)Synchronization Jump Width

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_TSCC register
//
//*************************************************************************************************
#define MCAN_TSCC_TSS_S   0U
#define MCAN_TSCC_TSS_M   0x3U       // Timestamp Select
#define MCAN_TSCC_TCP_S   16U
#define MCAN_TSCC_TCP_M   0xF0000U   // Timestamp Counter Prescaler

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_TSCV register
//
//*************************************************************************************************
#define MCAN_TSCV_TSC_S   0U
#define MCAN_TSCV_TSC_M   0xFFFFU   // Timestamp Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_TOCC register
//
//*************************************************************************************************
#define MCAN_TOCC_ETOC    0x1U          // Enable Timeout Counter
#define MCAN_TOCC_TOS_S   1U
#define MCAN_TOCC_TOS_M   0x6U          // Timeout Select
#define MCAN_TOCC_TOP_S   16U
#define MCAN_TOCC_TOP_M   0xFFFF0000U   // Timeout Period

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_TOCV register
//
//*************************************************************************************************
#define MCAN_TOCV_TOC_S   0U
#define MCAN_TOCV_TOC_M   0xFFFFU   // Timeout Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_ECR register
//
//*************************************************************************************************
#define MCAN_ECR_TEC_S   0U
#define MCAN_ECR_TEC_M   0xFFU       // Transmit Error Counter
#define MCAN_ECR_REC_S   8U
#define MCAN_ECR_REC_M   0x7F00U     // Receive Error Counter
#define MCAN_ECR_RP      0x8000U     // Receive Error Passive
#define MCAN_ECR_CEL_S   16U
#define MCAN_ECR_CEL_M   0xFF0000U   // CAN Error Logging

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_PSR register
//
//*************************************************************************************************
#define MCAN_PSR_LEC_S    0U
#define MCAN_PSR_LEC_M    0x7U        // Last Error Code
#define MCAN_PSR_ACT_S    3U
#define MCAN_PSR_ACT_M    0x18U       // Node Activity
#define MCAN_PSR_EP       0x20U       // Error Passive
#define MCAN_PSR_EW       0x40U       // Warning Status
#define MCAN_PSR_BO       0x80U       // Bus_Off Status
#define MCAN_PSR_DLEC_S   8U
#define MCAN_PSR_DLEC_M   0x700U      // Data Phase Last Error Code
#define MCAN_PSR_RESI     0x800U      // ESI Flag of Last Received CAN FD Message
#define MCAN_PSR_RBRS     0x1000U     // BRS Flag of Last Received CAN FD Message
#define MCAN_PSR_RFDF     0x2000U     // Received a CAN FD Message
#define MCAN_PSR_PXE      0x4000U     // Protocol Exception Event
#define MCAN_PSR_TDCV_S   16U
#define MCAN_PSR_TDCV_M   0x7F0000U   // Transmitter Delay Compensation Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_TDCR register
//
//*************************************************************************************************
#define MCAN_TDCR_TDCF_S   0U
#define MCAN_TDCR_TDCF_M   0x7FU     // Transmitter Delay Compensation Filter Window Length
#define MCAN_TDCR_TDCO_S   8U
#define MCAN_TDCR_TDCO_M   0x7F00U   // Transmitter Delay Compensation Offset

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAN_IR register
//
//*************************************************************************************************
#define MCAN_IR_RF0N   0x1U          // Rx FIFO 0 New Message
#define MCAN_IR_RF0W   0x2U          // Rx FIFO 0 Watermark Reached
#define MCAN_IR_RF0F   0x4U          // Rx FIFO 0 Full
#define MCAN_IR_RF0L   0x8U          // Rx FIFO 0 Message Lost
#define MCAN_IR_RF1N   0x10U         // Rx FIFO 1 New Message
#define MCAN_IR_RF1W   0x20U         // Rx FIFO 1 Watermark Reached
#define MCAN_IR_RF1F   0x40U         // Rx FIFO 1 Full
#define MCAN_IR_RF1L   0x80U         // Rx FIFO 1 Message Lost
#define MCAN_IR_HPM    0x100U        // High Priority Message
#define MCAN_IR_TC     0x200U        // Transmission Completed
#define MCAN_IR_TCF    0x400U        // Transmission Cancellation Finished
#define MCAN_IR_TFE    0x800U        // Tx FIFO Empty
#define MCAN_IR_TEFN   0x1000U       // Tx Event FIFO New Entry
#define MCAN_IR_TEFW   0x2000U       // Tx Event FIFO Watermark Reached
#define MCAN_IR_TEFF   0x4000U       // Tx Event FIFO Full
#define MCAN_IR_TEFL   0x8000U       // Tx Event FIFO Element Lost
#define MCAN_IR_TSW    0x10000U      // Timestamp Wraparound
#define MCAN_IR_MRAF   0x20000U      // Message RAM Access Failure
#define MCAN_IR_TOO    0x40000U      // Timeout Occurred
#define MCAN_IR_DRX    0x80000U      // Message Stored to Dedicated Rx Buffer
#define MCAN_IR_BEU    0x200000U     // Bit Error Uncorrected
#define MCAN_IR_ELO    0x400000U     // Error Logging Overflow
#define MCAN_IR_EP     0x800000U     // Error Passive
#define MCAN_IR_EW     0x1000000U    // Warning Status
#define MCAN_IR_BO     0x2000000U    // Bus_Off Status
#define MCAN_IR_WDI    0x4000000U    // Watchdog Interrupt
#define MCAN_IR_PEA    0x8000000U    // Protocol Error in Arbitration Phase
#define MCAN_IR_PED    0x10000000U   // Protocol Error in Data Phase
#define MCAN_IR_ARA    0x20000000U   // Access to Reserved Address

